{"modelTopology": {"keras_version": "2.2.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1280, 1], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "Batchnorm_net._batch_norm_input", "class_name": "BatchNormalization", "config": {"name": "Batchnorm_net._batch_norm_input", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "net.cnn.0", "class_name": "Conv1D", "config": {"name": "net.cnn.0", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Batchnorm_net._batch_norm_input", 0, 0, {}]]]}, {"name": "Relu_net_0", "class_name": "Activation", "config": {"name": "Relu_net_0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.0", 0, 0, {}]]]}, {"name": "net.cnn.0._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.0._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_0", 0, 0, {}]]]}, {"name": "net.cnn.1", "class_name": "Conv1D", "config": {"name": "net.cnn.1", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.0._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_1", "class_name": "Activation", "config": {"name": "Relu_net_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.1", 0, 0, {}]]]}, {"name": "net.cnn.1._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.1._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_1", 0, 0, {}]]]}, {"name": "net.cnn.2", "class_name": "Conv1D", "config": {"name": "net.cnn.2", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.1._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_2", "class_name": "Activation", "config": {"name": "Relu_net_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.2", 0, 0, {}]]]}, {"name": "net.cnn.2._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.2._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_2", 0, 0, {}]]]}, {"name": "net.cnn.3", "class_name": "Conv1D", "config": {"name": "net.cnn.3", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.2._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_3", "class_name": "Activation", "config": {"name": "Relu_net_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.3", 0, 0, {}]]]}, {"name": "net.cnn.3._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.3._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_3", 0, 0, {}]]]}, {"name": "net.cnn.4", "class_name": "Conv1D", "config": {"name": "net.cnn.4", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.3._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_4", "class_name": "Activation", "config": {"name": "Relu_net_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.4", 0, 0, {}]]]}, {"name": "net.cnn.4._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.4._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_4", 0, 0, {}]]]}, {"name": "net.cnn.5", "class_name": "Conv1D", "config": {"name": "net.cnn.5", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.4._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_5", "class_name": "Activation", "config": {"name": "Relu_net_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.5", 0, 0, {}]]]}, {"name": "net.cnn.5._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.5._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_5", 0, 0, {}]]]}, {"name": "net.cnn.6", "class_name": "Conv1D", "config": {"name": "net.cnn.6", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.5._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_6", "class_name": "Activation", "config": {"name": "Relu_net_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.6", 0, 0, {}]]]}, {"name": "net.cnn.6._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.6._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_6", 0, 0, {}]]]}, {"name": "net.cnn.7", "class_name": "Conv1D", "config": {"name": "net.cnn.7", "trainable": true, "filters": 64, "kernel_size": [5], "strides": [2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["net.cnn.6._batch_norm", 0, 0, {}]]]}, {"name": "Relu_net_7", "class_name": "Activation", "config": {"name": "Relu_net_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["net.cnn.7", 0, 0, {}]]]}, {"name": "net.cnn.7._batch_norm", "class_name": "BatchNormalization", "config": {"name": "net.cnn.7._batch_norm", "trainable": true, "axis": 2, "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Relu_net_7", 0, 0, {}]]]}, {"name": "Flatten_", "class_name": "Flatten", "config": {"name": "Flatten_", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["net.cnn.7._batch_norm", 0, 0, {}]]]}, {"name": "Dropout__83", "class_name": "Dropout", "config": {"name": "Dropout__83", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Flatten_", 0, 0, {}]]]}, {"name": "Gemm__dense", "class_name": "Dense", "config": {"name": "Gemm__dense", "trainable": true, "units": 80, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout__83", 0, 0, {}]]]}, {"name": "Relu__8", "class_name": "Activation", "config": {"name": "Relu__8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Gemm__dense", 0, 0, {}]]]}, {"name": "Dropout__87", "class_name": "Dropout", "config": {"name": "Dropout__87", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Relu__8", 0, 0, {}]]]}, {"name": "Gemm_logit", "class_name": "Dense", "config": {"name": "Gemm_logit", "trainable": true, "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout__87", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["Gemm_logit", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "Batchnorm_net._batch_norm_input/gamma", "shape": [1], "dtype": "float32"}, {"name": "Batchnorm_net._batch_norm_input/beta", "shape": [1], "dtype": "float32"}, {"name": "Batchnorm_net._batch_norm_input/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "Batchnorm_net._batch_norm_input/moving_variance", "shape": [1], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "Gemm__dense/kernel", "shape": [4672, 80], "dtype": "float32"}, {"name": "Gemm__dense/bias", "shape": [80], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "Gemm_logit/kernel", "shape": [80, 4], "dtype": "float32"}, {"name": "Gemm_logit/bias", "shape": [4], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "net.cnn.0/kernel", "shape": [5, 1, 64], "dtype": "float32"}, {"name": "net.cnn.0/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "net.cnn.0._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.0._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.0._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.0._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "net.cnn.1/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.1/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "net.cnn.1._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.1._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.1._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.1._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "net.cnn.2/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "net.cnn.2._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.2._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.2._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.2._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "net.cnn.3/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.3/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "net.cnn.3._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.3._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.3._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.3._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "net.cnn.4/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.4/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "net.cnn.4._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.4._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.4._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.4._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "net.cnn.5/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.5/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "net.cnn.5._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.5._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.5._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.5._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "net.cnn.6/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.6/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "net.cnn.6._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.6._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.6._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.6._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "net.cnn.7/kernel", "shape": [5, 64, 64], "dtype": "float32"}, {"name": "net.cnn.7/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "net.cnn.7._batch_norm/gamma", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.7._batch_norm/beta", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.7._batch_norm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "net.cnn.7._batch_norm/moving_variance", "shape": [64], "dtype": "float32"}]}]}